Tekla.Structures.Drawing.CurvedDimensionSetBase
The CurvedDimensionSetBase class is the base class for curved dimension sets which are defined by
an arc and a point list.

Tekla.Structures.Drawing.CurvedDimensionSetBase.ArcPoint1
Gets the first arc point.

Tekla.Structures.Drawing.CurvedDimensionSetBase.ArcPoint2
Gets the second arc point.

Tekla.Structures.Drawing.CurvedDimensionSetBase.ArcPoint3
Gets the third arc point.

Tekla.Structures.Drawing.CurvedDimensionSetBase.Distance
Gets the distance.
The distance is measured in paper millimeters.

Tekla.Structures.Drawing.CurvedDimensionSetBase.Attributes
Gets or sets the dimension set attributes.

Tekla.Structures.Drawing.CurvedDimensionSetBase.DimensionPoints
Gets a list of the dimension points.

Tekla.Structures.Drawing.CurvedDimensionSetBase.Insert
Curved dimensions are created using the curved dimension set handler.
Returns: An exception.
Throws System.InvalidOperationException: Curved dimensions are created using the curved dimension set handler.

Tekla.Structures.Drawing.CurvedDimensionSetBase.InternalInsert
Dimension sets can only be Inserted Internally.
Returns: True if Insert succeeds.

Tekla.Structures.Drawing.CurvedDimensionSetBase.Select
Selects the dimension set from the database.
Returns: True if the selection succeeds.

Tekla.Structures.Drawing.CurvedDimensionSetBase.Modify
Modifies the existing dimension set in the database.
Returns: True if the updating succeeds.

Tekla.Structures.Drawing.CurvedDimensionSetBase.Delete
Deletes the dimension set and its child dimensions from the database.
Returns: True if the deletion succeeds.